pitydah/michi-music-stream/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# Phase 9: BLE provisioning transport (wifi_prov_mgr + protocomm_ble).
# NimBLE host; symbols verified against ESP-IDF release-v5.3 (the
# wifi_prov_mgr example uses exactly these two - the BTDM_CTRL_MODE_*
# overrides of that example are ESP32-classic only and do not exist for
# the ESP32-S3 controller).
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# Phase 11: RTP/UDP audio engine. The UDP receive mailbox must hold more
# than the jitter buffer capacity (50 packets @ 10 ms at the 500 ms default)
# so network bursts land in the jitter buffer instead of lwip's default
# 6-packet mailbox (drops there are invisible to the engine metrics).
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
# P0-02: SNTP wall clock for signed discovery. michi_time uses the IDF
# 5.3 esp_netif_sntp API (esp_netif_sntp_init/start/sync_wait) as authority;
# no explicit CONFIG_LWIP_SNTP symbol is required under IDF 5.3.

# MS-11 on-device: the boot path (identity+wifi+discovery+time init chained
# through log_vprintf 504B frames) overflows the IDF default 3584B main
# task stack; 8192 leaves ample headroom.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# P0: RTP datagrams at 10 ms (1920B payload + headers ≈ 1960B) exceed standard
# 1500B Wi-Fi MTU. IPv4 reassembly must be enabled in lwIP to reassemble fragments.
CONFIG_LWIP_IP4_REASSEMBLY=y

# SKU manufacturing expectation: audio receiver units require audio hardware (DAC)
CONFIG_MICHI_SKU_EXPECTS_AUDIO=y
